tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned/0.orig/beamone/M
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      M;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(2.10948309809e-22 -4.61650523378e-07 -3.81201343854e-22)
(3.628643202e-22 -8.18675197684e-07 -6.52289768074e-22)
(4.65088690119e-22 -1.09435542766e-06 -8.31747640938e-22)
(5.23131563144e-22 -1.30680478118e-06 -9.30782125569e-22)
(5.41729320271e-22 -1.47011250379e-06 -9.58974905541e-22)
(5.26334065892e-22 -1.59523469733e-06 -9.26961107762e-22)
(4.83740319559e-22 -1.69068858457e-06 -8.47498604796e-22)
(4.21727833998e-22 -1.76309317617e-06 -7.3479105678e-22)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-2.45532559052e-35 -1.00042210394e-35 -1.11996571934e-35);
    }
    right
    {
        type            calculated;
        value           uniform (5.29867573186e-35 -2.65031298139e-35 -8.83858566532e-36);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
