tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned/0.orig/beamone/pointW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "2";
    object      pointW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1312
(
(0.250488846214 0.025 0.000127630021906)
(0.250479453171 0.025 0.000125177646823)
(0.250451635012 0.025 0.000117914764973)
(0.250406460772 0.025 0.000106120484833)
(0.250345666473 0.025 9.02480539728e-05)
(0.250271588405 0.025 7.09074410106e-05)
(0.250187073347 0.025 4.88418948557e-05)
(0.250095369165 0.025 2.48993820724e-05)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
