tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned/0.orig/beamone/refW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      refW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
40
(
(0.249551880897 0.025 0.001562499998)
(0.24865564269 0.025 0.00468749999401)
(0.247759404484 0.025 0.00781249999002)
(0.246863166278 0.025 0.010937499986)
(0.245966928071 0.025 0.014062499982)
(0.245070689865 0.025 0.017187499978)
(0.244174451658 0.025 0.020312499974)
(0.243278213452 0.025 0.02343749997)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.25 0.025 -2.09793410766e-21);
    }
    right
    {
        type            calculated;
        value           uniform (0.214150471744 0.025 0.12499999984);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
