tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned/0.orig/beamone/refWf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "0";
    object      refWf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
39
(
(0.249103761794 0.025 0.00312499999601)
(0.248207523587 0.025 0.00624999999201)
(0.247311285381 0.025 0.00937499998802)
(0.246415047174 0.025 0.012499999984)
(0.245518808968 0.025 0.01562499998)
(0.244622570762 0.025 0.018749999976)
(0.243726332555 0.025 0.021874999972)
(0.242830094349 0.025 0.0249999999681)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.25 0.025 -2.09793410766e-21);
    }
    right
    {
        type            calculated;
        value           uniform (0.214150471744 0.025 0.12499999984);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
